config/conf-behaviour.org
#+TITLE: Conf Behaviour
#+AUTHOR: Gopinath Sadasivam
#+BABEL: :cache yes

* Enabled Config
 :PROPERTIES:
 :header-args: :tangle yes
 :END:
** ace-windows : C-x o
  (set-face-attribute
   'aw-mode-line-face nil
   :inherit 'mode-line-buffer-id
   :foreground "lawn green")
#+BEGIN_SRC emacs-lisp
(defun joe-scroll-other-window()
  (interactive)
  (scroll-other-window 1))
(defun joe-scroll-other-window-down ()
  (interactive)
  (scroll-other-window-down 1))
(use-package ace-window
  :config
  (set-face-attribute
   'aw-leading-char-face nil
   :foreground "deep sky blue"
   :weight 'bold
   :height 3.0)
  (setq aw-keys '(?a ?s ?d ?f ?j ?k ?l)
        ;aw-dispatch-always t
        aw-dispatch-alist
        '((?x aw-delete-window "Ace - Delete Window")
          (?c aw-swap-window "Ace - Swap Window")
          (?n aw-flip-window)
          (?v aw-split-window-vert "Ace - Split Vert Window")
          (?h aw-split-window-horz "Ace - Split Horz Window")
          (?m delete-other-windows "Ace - Maximize Window")
          (?g delete-other-windows)
          (?b balance-windows)
          (?u (lambda ()
                (progn
                  (winner-undo)
                  (setq this-command 'winner-undo))))
          (?r winner-redo))
        )

  (use-package hydra
    :config
    (defhydra hydra-window-size (:color red)
      "Windows size"
      ("h" shrink-window-horizontally "shrink horizontal")
      ("j" shrink-window "shrink vertical")
      ("k" enlarge-window "enlarge vertical")
      ("l" enlarge-window-horizontally "enlarge horizontal"))
    (defhydra hydra-window-frame (:color red)
      "Frame"
      ("f" make-frame "new frame")
      ("x" delete-frame "delete frame"))
    (defhydra hydra-window-scroll (:color red)
      "Scroll other window"
      ("n" joe-scroll-other-window "scroll")
      ("p" joe-scroll-other-window-down "scroll down"))
    (add-to-list 'aw-dispatch-alist '(?w hydra-window-size/body) t)
    (add-to-list 'aw-dispatch-alist '(?o hydra-window-scroll/body) t)
    (add-to-list 'aw-dispatch-alist '(?\; hydra-window-frame/body) t))
  (ace-window-display-mode -1) ;don't clutter mode-line
  (global-set-key (kbd "C-x o") 'ace-window))
#+END_SRC
** recentf : SPC f r

#+BEGIN_SRC emacs-lisp
(use-package recentf
  :defer t
  :init
  ;;(idle-require-mode 1)
  :config (progn (setq recentf-auto-cleanup 'never
                       recentf-max-menu-items 50
                       recentf-max-saved-items 80
                       recentf-save-file
                       ;;(expand-file-name "temp/.recentf" user-emacs-directory)
                       (expand-file-name ".recentf" user-emacs-directory)
                       )
                 (recentf-mode t)))
#+END_SRC

** ivy

#+BEGIN_SRC emacs-lisp
(use-package ivy 
  :diminish (ivy-mode . "")
  :bind
  (:map ivy-mode-map
        ("C-'" . ivy-avy))
  :config

  (setq ivy-use-virtual-buffers t
        ivy-height 15
        ivy-display-style 'fancy
        ivy-count-format "(%d/%d) "
        ivy-initial-inputs-alist nil ; remove initial ^ input.
        ivy-extra-directories nil ; remove . and .. directory.
        ivy-wrap nil)

  (ivy-mode 1)
  ;; add ¡®recentf-mode¡¯ and bookmarks to ¡®ivy-switch-buffer¡¯.
  (setq ivy-use-virtual-buffers t)
  ;; number of result lines to display
  (setq ivy-height 10)
  ;; does not count candidates
  (setq ivy-count-format "")
  ;; no regexp by default
  (setq ivy-initial-inputs-alist nil)
  ;; configure regexp engine.
  (setq ivy-re-builders-alist
        ;; allow input not in order
        '((t   . ivy--regex-ignore-order))))
#+END_SRC

** avy and counse-ace-link

(ace-link-setup-default)
("o" counsel-ace-link "url")
#+BEGIN_SRC emacs-lisp
(use-package avy :defer t
:config
(defhydra hydra-avy (:color teal)
  ("c" avy-goto-char "char")
  ("w" avy-goto-word-0 "word")
  ("l" avy-goto-line "line")
  ("p" avy-pop-mark "pop")))
#+END_SRC
** counsel
#+BEGIN_SRC emacs-lisp
(use-package counsel 
  :config
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t)
  (global-set-key (kbd "C-c C-r") 'ivy-resume)
  (global-set-key (kbd "<f6>") 'ivy-resume)
  (global-set-key (kbd "M-x") 'counsel-M-x)
  (global-set-key (kbd "C-x C-f") 'counsel-find-file)
  (global-set-key (kbd "C-x C-r") 'counsel-recentf)
  (global-set-key (kbd "<f1> f") 'counsel-describe-function)
  (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
  (global-set-key (kbd "<f1> l") 'counsel-find-library)
  (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
  (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
  (global-set-key (kbd "C-c g") 'counsel-git)
  (global-set-key (kbd "C-c j") 'counsel-git-grep)
  (global-set-key (kbd "C-c k") 'helm-do-grep-ag)
  (global-set-key (kbd "C-x l") 'counsel-locate)
  (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
  (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
  (setq projectile-completion-system 'ivy)
  )
#+END_SRC
** swiper
#+BEGIN_SRC emacs-lisp
(use-package swiper 
  :config)
#+END_SRC
** smex
just install it let counsel-M-x use smex.
#+BEGIN_SRC emacs-lisp
(use-package smex
  :config
  (smex-initialize))
#+END_SRC

** yasnippet

#+BEGIN_SRC emacs-lisp
(use-package yasnippet
  :defer t
  :init
  (yas-global-mode 1)
  (setq yas/indent-line nil))

(use-package ivy-yasnippet
  :defer t
  :config
  )
#+END_SRC

** evil-collection
#+begin_src emacs-lisp
(use-package evil-collection
  :custom (evil-collection-setup-minibuffer t)
  :init
  (setq evil-want-keybinding nil)
  (evil-collection-init))
#+end_src
** dired configs

http://ergoemacs.org/emacs/emacs_dired_tips.html
https://github.com/magnars/.emacs.d/blob/master/settings/setup-dired.el

#+BEGIN_SRC emacs-lisp
(setq dired-recursive-copies (quote always)) ;no asking
(setq dired-recursive-deletes (quote top)) ; ask once
(setq dired-dwim-target t)

;hide details
(defun xah-dired-mode-setup ()
  "to be run as hook for `dired-mode'."
  (dired-hide-details-mode 1))
(add-hook 'dired-mode-hook 'xah-dired-mode-setup)

(define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file) ; was dired-advertised-find-file

; was dired-up-directory
(define-key dired-mode-map (kbd "^") (lambda () (interactive) (find-alternate-file "..")))  

; put directories first
(setq ls-lisp-dirs-first t)
(setq dired-recursive-deletes 'top)
(setq dired-listing-switches "-hal")
(setq diredp-hide-details-initially-flag nil)


(use-package dired-narrow)


#+END_SRC

a: list all files
h, --human-readable: with -l, print sizes in human readable format (e.g., 1K 234M 2G)
l: use a long listing format
group-directories-first: group directories before files
X: sort alphabetically by entry extension
U: do not sort; list entries in directory order
t: sort by modification time, newest first
S: sort by file size

** Company mode
#+BEGIN_SRC emacs-lisp
(use-package company
  :config
  (progn
    (add-hook 'after-init-hook 'global-company-mode)))
#+END_SRC
** projectile

Have to come before loading org mode, to setup wiki workspaces (SPC-p-w)
Let's not defer it must be loaded to work with org-wiki setups.

#+BEGIN_SRC emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  (projectile-mode))
#+END_SRC

** org save,toggle and byte-compile config files!
   
#+BEGIN_SRC emacs-lisp
(defun my/tangle-dotfiles ()
  "If the current file is in '~/.dotfiles', the code blocks are tangled"
  (when (equal (file-name-directory (directory-file-name buffer-file-name)) user-config-directory)
    (org-babel-tangle)
    (message "%s tangled" buffer-file-name)
    (if (file-exists-p (concat buffer-file-name "c"))
                  (delete-file (concat buffer-file-name "c")))
    (my/byte-compile-init-dir)))

(add-hook 'after-save-hook #'my/tangle-dotfiles)

#+END_SRC

** super-save
#+BEGIN_SRC emacs-lisp
(use-package super-save
  :defer t
  :config
  (setq super-save-auto-save-when-idle t)
  (setq auto-save-default nil) ; turnoff default backups
  (setq super-save-remote-files nil) ;don't autosave remote files
  (setq super-save-exclude '(".gpg")) ;avoid auto saving gpg files
  (super-save-mode +1))
#+END_SRC

* Disabled Config
 :PROPERTIES:
 :header-args: :tangle no
 :END:
 
** dired-hacks, dired-subtree, dired-narrow


#+begin_src emacs-lisp

(use-package dired-hacks
  :config
  (progn
    (use-package dired-subtree
      :config
      (bind-key "<tab>" #'dired-subtree-toggle dired-mode-map)
      (bind-key "<backtab>" #'dired-subtree-cycle dired-mode-map)
      )

    (use-package dired-narrow
      :bind (:map dired-mode-map
                  ("/" . dired-narrow)))
    )
  )
#+end_src

*** dired-sidebar
#+begin_src emacs-lisp
(use-package vscode-icon)
(use-package dired-sidebar
  :bind (("C-x C-n" . dired-sidebar-toggle-sidebar))
  :commands (dired-sidebar-toggle-sidebar)
  :init
  (add-hook 'dired-sidebar-mode-hook
            (lambda ()
              (unless (file-remote-p default-directory)
                (auto-revert-mode))))
  :config
  (push 'toggle-window-split dired-sidebar-toggle-hidden-commands)
  (push 'rotate-windows dired-sidebar-toggle-hidden-commands)

  (setq dired-sidebar-subtree-line-prefix "__")
  (setq dired-sidebar-theme 'vscode)
  (setq dired-sidebar-use-term-integration t)
  (setq dired-sidebar-use-custom-font t))
#+end_src
** Hydra helpers zoom in and zoom out
#+BEGIN_SRC emacs-lisp
(use-package hydra
  :config
  (key-chord-define-global "QZ"
                           (defhydra hydra-zoom ()
                             "zoom"
                             ("+" text-scale-increase "in")
                             ("-" text-scale-decrease "out")
                             ("0" (text-scale-adjust 0) "reset")
                             ("q" nil "quit" :color blue))))
#+END_SRC
** eye-browse : SPC e
#+BEGIN_SRC emacs-lisp
(use-package eyebrowse
  :config
  (eyebrowse-mode t)
  ;; (eyebrowse-setup-evil-keys)
  (setq eyebrowse-mode-line-separator " "
	eyebrowse-new-workspace t
	eyebrowse-wrap-around t
	eyebrowse-mode-line-style t))

(use-package hydra
  :after eyebrowse
  :config
  (defhydra hydra-eyebrowse-nav (:hint nil)
    "
_n_: next            _0_: window config 0
_p_: prev            _1_: window config 1
_l_: last            _2_: window config 2
_c_: create config   _3_: window config 3
_D_: delete config   _4_: window config 4
_r_: rename config   _q_:quit"
    ("n" eyebrowse-next-window-config)
    ("p" eyebrowse-prev-window-config)
    ("l" eyebrowse-last-window-config)
    ("c" eyebrowse-create-window-config)
    ("D" eyebrowse-close-window-config)
    ("r" eyebrowse-rename-window-config)
    ("0" eyebrowse-switch-to-window-config-0)
    ("1" eyebrowse-switch-to-window-config-1)
    ("2" eyebrowse-switch-to-window-config-2)
    ("3" eyebrowse-switch-to-window-config-3)
    ("4" eyebrowse-switch-to-window-config-4)
    ("q" nil :color blue))
  (global-set-key (kbd "C-;") 'hydra-eyebrowse-nav/body)
  )
#+END_SRC
** purpose
#+BEGIN_SRC emacs-lisp
(use-package window-purpose
  :config
  (define-key purpose-mode-map (kbd "C-c ,") nil)
  (define-key purpose-mode-map (kbd "C-c w") purpose-mode-prefix-map)

  (purpose-add-user-purposes
   :modes  '((org-mode . edit)
             (org-mode . edit)))
  (purpose-compile-user-configuration)
  (purpose-x-code1-setup)
  (purpose-x-popwin-setup)
  (purpose-x-kill-setup)
  (purpose-x-magit-single-on)

  (purpose-mode t)

  (add-hook 'after-init-hook
            (lambda ()
              (when (file-exists-p purpose-default-layout-file)
                (purpose-load-window-layout-file))
              (select-window (get-largest-window)))))
#+END_SRC

** all-the-icons
looks like mode-line needs utf-8 icons can be inserted in buffer but not in modeline as of now
#+BEGIN_SRC emacs-lisp
(use-package all-the-icons
  :if (display-graphic-p)
  :config
  (add-hook 'after-change-major-mode-hook
            (lambda ()
              (let* ((icon (all-the-icons-icon-for-mode major-mode))
                     (face-prop (and (stringp icon) (get-text-property 0 'face icon))))
                (when (and (stringp icon) (not (string= major-mode icon)) face-prop)
                  (setq mode-name (propertize icon 'display '(:ascent center))))))))
#+END_SRC
